app/controllers/sessions_controller.rb

INSERT INTO "users" ("provider", "uid", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["provider", "github"], ["uid", "7784620"], ["name", "Jerome Chenette"], ["created_at", "2015-06-21 22:17:37.330766"], ["updated_at", "2015-06-21 22:17:37.330766"]]
SELECT  "users".* FROM "users" WHERE "users"."provider" = ? AND "users"."uid" = ? LIMIT 1  [["provider", "github"], ["uid", "7784620"]]
---
  def create
  p "we're in omniauth create"
  # raise request.env["omniauth.auth"].to_json
  auth = request.env["omniauth.auth"]
  user = User.find_by_provider_and_uid(auth["provider"], auth["uid"]) || User.create_with_omniauth(auth)